
*** Example Decorator:

#+BEGIN_SRC typescript
  const person = { name: "Matthew" };

function addAge(age: Number) {
    return function(person) {
        return person.age = age;
    };
}

addAge(31)(person);

console.log(person);
#+END_SRC

#+RESULTS:
: ../../../../../../../var/folders/g_/g848zjzd0wb7bvcwskj1qkf40000gn/T/babel-15753bpM/ts-src-15753uVE.ts(5,23): error TS2339: Property 'age' does not exist on type 'Object'.
: { name: 'Matthew', age: 31 }

** Union Types and Type Aliases
We can annotate variables to have more than one type. This is called a Union Type. Declaring Union Types is easy enough, but to pass a variable set as a union type to a function, the function signature must mirror the variables type flexibility.

#+BEGIN_SRC typescript
  let thing: string | number = 23;

  let returnSomething = (someThing: string | number) => {
        return someThing;
  }

  console.log(returnSomething(thing));
  thing = "twenty three";
  console.log(returnSomething(thing));
#+END_SRC

#+RESULTS:
: 23
: twenty three

This can be onerous for variables that have lengthy type annotations. Thankfully TS gives us the =type= keyword. The type keyword lets us associate a union type with a new type name. In our var declarations and function signatures, we can use this new type name.

#+BEGIN_SRC typescript
  type thing = string | number | string[] | boolean;
  let returnSomeThing = (someThing: thing) => {
    return someThing;
  }
  let foo = "bar";
  console.log(returnSomeThing(foo));
  foo = "baz";
  console.log(returnSomeThing(foo));
#+END_SRC

#+RESULTS:
: bar
: baz

** Type Guards
Sometimes we want a function to behave differently, depending on the type of one of its arguments. We can use type guards as predicates that accept a variable and return its type. TS gives us access to =typeof= and =instanceof=. When using instanceof, the tsc will be able to provide its IDE features after a successful check. In the example below, we had access to autocompletion in the second if block for Array methods, because the tsc knew someThing was an array in that block.

#+BEGIN_SRC typescript
type thing = string | number | string[] | boolean;
let returnSomeThing = (someThing: thing) => {
  if (typeof someThing === "string"  ||
      typeof someThing === "number" ||
      typeof someThing === "boolean") {
     console.log("something = ", someThing);
  }
  if (someThing instanceof Array) {
      let joinedThings = "";
      someThing.forEach((thing) => {
          joinedThings += `${thing}`;
      });
      console.log("joinedThings: ", joinedThings);
  }
};

//returnSomeThing(2343);
//returnSomeThing("Matthew");
//returnSomeThing(true);
returnSomeThing(["Hello", " ", "world", "!"]);
#+END_SRC

#+RESULTS:
: joinedThings:  Hello world!

** Using Interfaces to Describe Types
Interfaces describe the shape of an object type. This is somewhat analagous to a database schema. 
  Interfaces are declared with the =interface= keyword, a name, and an object literal with 
=parameter: type= pairs, which correspond to object properties and the corresponding types of those properties. When an object is declared, it can recieve an interface as a type annotation.
  Interfaces do not set properties on a type, so it is up to us to supply objects of an 
interface with property values. Normally, objects of an interface type must contain each parameter specified in the interface. However, we can declare optional parameters in the interface, by using a =?= after the property name.
  We can also use interfaces in functions to annotate arguments, or we can create inferfaces for 
a function. In the example below, we inline a type for the opponent argument of the AttackFunction interface. This function interface describes the shape of the function: the types that the function recieves as arguments, and the type returned from the function. 
  Also note that we can annotate an interface parameter with an interface. In the example, the 
attackFunction interface appears as the type annotation for the comicBookCharacter interface's attack parameter.
  The tsc will err if interface objects access properties not present on the interface. Instead of filling 
interfaces with optional parameters, consider creating an interface containing optional properties, and extending one interface with another. 


#+BEGIN_SRC typescript
  interface OptionalAttributes {
    strength?: number;
    insanity?: number;
    dexterity?: number;
    healingFactor?: number;
}

  interface AttackFunction {
    (opponent: {alias: string; health: number; }, attackWith: number): number;
  }

  interface ComicBookCharacter extends OptionalAttributes {
    secretIdentity?: string;
    alias: string;
    health: number;
    attack: AttackFunction;
  }

function attackFunc(opponent, attackWith) {
  opponent.health -= attackWith;
  console.log(`${this.alias} attacked ${opponent.alias}, who's health = ${opponent.health}`);
  return opponent.health;
}

let superHero: ComicBookCharacter = {
  alias: "She-Hulk",
  health: 5000,
  strength: 5000,
  attack: attackFunc
};

let superVillan: ComicBookCharacter = {
  secretIdentity: "Jack Napier",
  alias: "Joker",
  health: 75,
  insanity: 100
};

superHero.attack(superVillan, superHero.strength);

function getSecretIdentity(character: ComicBookCharacter) { 
  if (character.secretIdentity) {
    console.log(`${character.alias} is ${character.secretIdentity}`);
  } else { 
    console.log(`${character.alias} has no secret identity`;)
  }
}

getSecretIdentity(superHero);
#+END_SRC

#+RESULTS:
: ../../../../../../../var/folders/g_/g848zjzd0wb7bvcwskj1qkf40000gn/T/babel-163805sU/ts-src-16380kWu.ts(45,60): error TS1005: ')' expected.
: ../../../../../../../var/folders/g_/g848zjzd0wb7bvcwskj1qkf40000gn/T/babel-163805sU/ts-src-16380kWu.ts(45,61): error TS1128: Declaration or statement expected.
: She-Hulk attacked Joker, who's health = -4925
: She-Hulk has no secret identity

** Creating a Class: Static, Private, and Public Properties
A TypeScript Class is a function. Functions are objects, so they can have properties and methods. By default, all Class properties are public, though we could add a =public= modifier for some reason... More useful is the =private= modifier. Private properties cannot be accessed outside of the class.
  We can set properties of a class at the time of instantiation if the Class has a constructor 
method. The Constructor method accepts arguments that can be used to set properties on the instance. Because the constructor is internal to the class, it can access private properties. We could also expose the private property through explicit getter methods, like the getSecretIdentity method below.
  TS gives a handy way to make our constructor more concise. We can preface the arguments of a 
constructor with modifiers to indicate that they are properties of the class, and they will be duly assigned as such.
  TS classes also have static properties, properties that are associated with the class, not the 
instances. To access them, you must call the method directly on the class. See createTeam below. While static methods cannot be called from an instance, they can access the private properties of the class's instances. (prototypal magic perhaps?)

#+BEGIN_SRC typescript
interface Opponent {
  alias: string;
  health: number;
}

class ComicBookCharacter {
  constructor(
    public alias: string,
    public health: number,
    public strength: number, 
    private secretIdentity: string) {
    
  /* THIS WAS DEPRECATED BY ADDITION OF ACCESS MODIFIERS TO CONSTRUCTOR SIGNATURE
    this.alias = alias;
    this.health = health;
    this.strength = strength;
    this.secretIdentity = secretIdentity;
  */

  }
  /* THIS WAS DEPRECATED BY ADDITION OF ACCESS MODIFIERS TO CONSTRUCTOR SIGNATURE
    alias: string;
    health: number;
    strength: number;
    private secretIdentity: string;
  */

  static createAndAssignTeam(teamName: string, members: ComicBookCharacter[]) {
    let team = {
      name: teamName,
      members: members
    };

    members.forEach((member) => {
      member.team = team;
    });
  }

  private team: {
    name: string,
    members: ComicBookCharacter[]
  }

  getTeamName() { console.log(`${this.alias} is on Team ${this.team.name}`);};

  getSecretIdentity() { 
    console.log(`${this.alias}'s secret identity is ${this.secretIdentity}`);
  }

  attackFunc(opponent: Opponent, attackWith: number) {
    opponent.health -= attackWith;
    console.log(`${this.alias} attacked ${opponent.alias} who's health = ${opponent.health}`);
  }
}

let storm = new ComicBookCharacter("Storm", 100, 100, "Ororo Munroe");
let theBlob = new ComicBookCharacter("The Blob", 1000, 5000, "Fred J. Dukes");

/* THIS WAS DEPRICATED BY ADDITION OF THE CONSTRUCTOR METHOD

let storm = new ComicBookCharacter();
storm.alias = "Storm";
storm.health = 100;
storm.strength = 100;
storm.secretIdentity = "Ororo Munroe"; // this fails because secretIdentity is a private property

let theBlob = new ComicBookCharacter();
theBlob.alias = "The Blob";
theBlob.health = 1000;
theBlob.strength = 5000;
theBlob.secretIdentity = "Fred J. Dukes";  // this fails because secretIdentity is a private property 

*/

storm.attackFunc(theBlob, storm.strength);
storm.getSecretIdentity(); 

ComicBookCharacter.createAndAssignTeam("oddCouple", [storm, theBlob]);
storm.getTeamName();
#+END_SRC

#+RESULTS:
: Storm attacked The Blob who's health = 900
: Storm's secret identity is Ororo Munroe
: Storm is on Team oddCouple

** Sharing Class Behavior with Inheritance, and Protected Properties
We can use the =extends= keyword to permit one class to inherit the constructor and properties of another class. Private properties are still private to their containing class, but =protected= properties can be accessed by derived classes.
  We can add functionality to derived classes. When you extend a class, without using a 
constructor, the derived class will use the base class's constructor. In order to augment the base class's contructor method, a derived class can have its own constructor method, but it must have a call to =super= as its first statement. Calling super is like calling the base class's constructor, and it is necessary to pass the arguments that were passed to the derived class into the call to super, so as to relay those arguments to the base class constructor. In the example below, the only arguments to the derived class are those needed by the base class, so the rest and spread operators manage the relay - though the tsc does complain.

#+BEGIN_SRC typescript
class ComicBookCharacter {
  constructor(
    public alias: string, public health: number,
    public strength: number,
    protected secretIdentity: string
  ) {}
}

class SuperHero extends ComicBookCharacter {
  traits = ["empathy", "strong moral code"];
}

class SuperVillan extends ComicBookCharacter {
  flaws = ["hubris", "always explains evil plan"];
  getSecretId() { console.log(this.secretIdentity); }

  constructor(...args) {
    super(...args);
    console.log(`${this.alias} eats kittens!`);
  }
}

let jubilee = new SuperHero("Jubilee", 23, 233, "Jubilation Lee");
let scarletWitch = new SuperVillan("Scarlet Witch", 233, 4444, "Wanda Maximoff");

console.log(scarletWitch.getSecretId());
#+END_SRC

#+RESULTS:
: ../../../../../../../var/folders/g_/g848zjzd0wb7bvcwskj1qkf40000gn/T/babel-163805sU/ts-src-16380ctb.ts(17,15): error TS7019: Rest parameter 'args' implicitly has an 'any[]' type.
: ../../../../../../../var/folders/g_/g848zjzd0wb7bvcwskj1qkf40000gn/T/babel-163805sU/ts-src-16380ctb.ts(18,5): error TS2346: Supplied parameters do not match any signature of call target.
: Scarlet Witch eats kittens!
: Wanda Maximoff
: undefined

** The Basics of Generics
We can use generics to declare that a function's arguments will be of a specific type, but that type will be determined dynamically, when the function is called. In the function signature, a set of anglebrackets follows the function name, and contains some identifier that we can use to type the function's arguments.
  When the function is called, the compiler will infer the generic type based on the types 
of the arguments. In the example below, the first call to push has no anglebrackets after the function name, and the compiler errs, reporting that the first argument - a string - cannot be inferred by the second type - an array of objects. The types don't match...
  But, if we want to control the generic type, the function name should also be followed 
by anglebrackets, containing the type that will be passed into the function. This allowsus to set the generic type when the function is called.

#+BEGIN_SRC typescript
function push<T>(something: T, collection: T[]) {
  collection.push(something);
  console.log(collection);
}

let jeanGrey = {name: "Jean Grey"};
let wolverine = {name: "Wolverine"};

let superHeroes = [jeanGrey];
let powers = ["teleinesis", "esp"];

interface SuperHero {name: string;}

//push("meh", superHeroes);
//push<SuperHero>("meh", superHeroes);
push<string>("adamantium claws", powers);

#+END_SRC

#+RESULTS:
: [ 'teleinesis', 'esp', 'adamantium claws' ]

** TODO Practical Generics
Generic types can contain anything, making them great containers. In the example, we have a generic interface - container - that lets us build crocContainers and taxContainers. If we want to be more specific about what we want to contain, we can use a generic constraint. A genric contraint can contain anything that has the constraint type. Our example has a CrocContainer interface, which can only contain objects that have a personality property, and a taxContainer interface, which can only contain objects with a year property.
  For class generic constraints, we can assign the class a generic constraint, and forgo 
the use of the constructor, and still get autocompletion for the constraint type. We can also set a type at instantiation to get autocompletion on both the constraint type and the declared type. If we add a property, that's not in the constraint or the declaredtype, the tsc will complain.
  If we want to use a constructor to set properties at instantiation, we get the same story: tsc will 
recognize properties from both the class's generic contraint, and any declared types. And, other properties will sound an error.
  As long as the instance has the constraint, we can add extra properties.

#+BEGIN_SRC typescript
interface Crocodile { personality: string; }
interface Taxes { year: number; }
interface Container<T> { unit: T; }

let crocContainer: Container<Crocodile> = { unit: { personality: "mean" } };
let taxContainer: Container<Taxes> = { unit: { year: 2011 } };

interface RedCroc extends Crocodile { color: "red"; }
interface BlueCroc extends Crocodile { color: "blue"; }
interface CrocContainer<T extends Crocodile> { crocUnit: T; }

let redCrocContainer: CrocContainer<RedCroc> = { crocUnit: { personality: "irate", color: "red" } };
let blueCrocContainer: CrocContainer<BlueCroc> = { crocUnit: { personality: "cool", color: "blue" } };

class ClassyContainer<T extends Crocodile> {
    classyCrosUnit: T;
}

let classyCrocContainer = new ClassyContainer<RedCroc>();
classyCrocContainer.classyCrocUnit = { personality: "classy", color: "red" };

class CCC<T extends Crocodile> {
    constructor(public cccUnit: T) { }
}

let ccc = new CCC<BlueCroc>({ personality: "ultra classy", 
                              likesCheetos: true, 
                              color: "blue" })
#+END_SRC

#+RESULTS:
: ../../../../../../../var/folders/rp/2kdmdq3d1fjcs2f98lm2dc900000gq/T/babel-6080wZ/ts-src-6082VW.ts(20,21): error TS2339: Property 'classyCrocUnit' does not exist on type 'ClassyContainer<RedCroc>'.
: ../../../../../../../var/folders/rp/2kdmdq3d1fjcs2f98lm2dc900000gq/T/babel-6080wZ/ts-src-6082VW.ts(27,31): error TS2345: Argument of type '{ personality: string; likesCheetos: boolean; color: "blue"; }' is not assignable to parameter of type 'BlueCroc'.
:   Object literal may only specify known properties, and 'likesCheetos' does not exist in type 'BlueCroc'.


**** Declaring an Interface


#+BEGIN_SRC typescript
  function printLabel(labelledObj: { label: string }) {
    console.log(labelledObj.label);
  }

  let myObj = {size: 10, label: "Size 10 Object"};
  printLabel(myObj);
#+END_SRC

#+RESULTS:
: Size 10 Object

We can store the notion of an object that has a label property of type string in an Interface. We declare an interface with the =interface= keyword, give it a name, and then detail an object literal with the desired properties and types.

#+BEGIN_SRC typescript
  interface LabelledValue {
    label: string;
  }

  function printLabel(labelledObj: LabelledValue) {
    console.log(labelledObj.label);
  }

  let myObj = {size: 10, label: "Size 10 Object"};
  printLabel(myObj);
#+END_SRC

#+RESULTS:
: Size 10 Object

